app/views/recipes/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", nil]]
---
  <li><%= r.date_posted %></li>
  <li><%= r.user.first_name + " " + r.user.last_name %></li>