app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "dasfd"], ["last_name", "dfsdf"], ["email", "sdfsdf"], ["created_at", "2015-03-03 19:11:13.145235"], ["updated_at", "2015-03-03 19:11:13.145235"]]
---
	def create
		@user = User.new(user_params)
    if @user.save